Repository: jchunf/Pulse
Catalog: Sources/PulseApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: 1 hour
zh_hans: 1 小时

source: 1 second
zh_hans: 1 秒

source: 10 seconds
zh_hans: 10 秒

source: 14 days
zh_hans: 14 天

source: 15 minutes
zh_hans: 15 分钟

source: 3 days
zh_hans: 3 天

source: 30 days
zh_hans: 30 天

source: 30 minutes
zh_hans: 30 分钟

source: 30 seconds
zh_hans: 30 秒

source: 5 seconds
zh_hans: 5 秒

source: 7 days
zh_hans: 7 天

source: About
zh_hans: 关于

source: App usage today
zh_hans: 今日 App 使用时长

source: How far your cursor has travelled today, in metres.
zh_hans: 今天你的鼠标走了多远（米）。

source: How long did I use…
zh_hans: 今天我用了多久…

source: Keystrokes today
zh_hans: 今日按键数

source: Mouse distance today
zh_hans: 今日鼠标距离

source: Returns the seconds you've spent in a given app today, read from Pulse's local data only.
zh_hans: 返回今天你在某个 App 中停留的秒数，仅读取 Pulse 本地数据。

source: The bundle identifier of the app (e.g. com.apple.dt.Xcode for Xcode).
zh_hans: App 的 bundle 标识（例如 Xcode 是 com.apple.dt.Xcode）。

source: Total key presses Pulse recorded for you today.
zh_hans: Pulse 今天为你记录的按键总数。

source: Accessibility
zh_hans: 辅助功能

source: Active time
zh_hans: 活跃时长

source: Build
zh_hans: 版本

source: Calendars
zh_hans: 日历

source: Clicks
zh_hans: 点击

source: Pulse isn't writing — check Settings.
zh_hans: Pulse 没有写入数据 — 请检查设置。

source: Couldn't start the collector: %@
zh_hans: 无法启动采集器：%@

source: Dashboard
zh_hans: 仪表盘

source: Database not available.
zh_hans: 数据库不可用。

source: Database size
zh_hans: 数据库大小

source: Database writes
zh_hans: 数据库写入次数

source: Pulse · Year so far
zh_hans: Pulse · 今年至今

source: %1$@ · as of %2$@
zh_hans: %1$@ · 截至 %2$@

source: Days with Pulse
zh_hans: 和 Pulse 一起的天数

source: Days in a row with 4+ active hours
zh_hans: 连续保持每天活跃 4 小时以上

source: A full week-long streak — keep going.
zh_hans: 已经连续一整周 —— 继续保持。

source: Two weeks in a row — that's the new normal now.
zh_hans: 连续两周 —— 这已经成了你的新常态。

source: A whole month of qualifying days. Rare and earned.
zh_hans: 整整一个月每天都达标 —— 难得，也是你应得的。

source: Recording since %@.
zh_hans: 从 %@ 开始记录。

source: Keystrokes
zh_hans: 按键

source: Pulse hasn't logged any cursor moves yet today. Move the mouse around — the number fills in within a minute.
zh_hans: Pulse 今天还没记录到光标移动。移动一下鼠标，数字会在一分钟内出现。

source: Keystrokes + clicks per day
zh_hans: 每日按键 + 点击总和

source: less
zh_hans: 较少

source: more
zh_hans: 较多

source: Roughly %@ words — about %@ a mid-length novel.
zh_hans: 约 %@ 个单词 —— 大概是 %@ 一本中等长度小说。

source: Mouse distance
zh_hans: 鼠标里程

source: Most-used apps
zh_hans: 最常用 App

source: Longest focus session
zh_hans: 最长专注片段

source: Busiest day
zh_hans: 最忙的一天

source: Busiest day: %1$@ — %2$@ keystrokes + clicks combined.
zh_hans: 最忙的一天：%1$@ —— 按键 + 点击合计 %2$@ 次。

source: %@ keystrokes + clicks combined.
zh_hans: 按键 + 点击合计 %@ 次。

source: Your rhythm
zh_hans: 你的节奏

source: Your peak hour. You were active across %lld of 24 hours of the day.
zh_hans: 你的活跃高峰时段。你在 24 小时中的 %lld 个小时段都活跃过。

source: Pulse needs a few more hours of recorded activity before it can pick out your peak. Check back at the end of a fuller day.
zh_hans: Pulse 还需要再多记录几个小时的活动才能找出你的高峰时段。等忙完一整天再回来看看吧。

source: Save as image…
zh_hans: 保存为图片…

source: Save year wrapped image
zh_hans: 保存年度回顾图片

source: Couldn't compute wrapped: %@
zh_hans: 无法计算年度回顾：%@

source: Open year so far…
zh_hans: 查看今年至今…

source: Recap
zh_hans: 回顾

source: Year-to-date totals — keystrokes, mouse distance, top apps, longest focus session — rendered as a single page you can save as an image.
zh_hans: 今年至今的总数 —— 按键、鼠标里程、最常用 App、最长专注片段 —— 显示在单页面上，可保存为图片。

source: Year so far
zh_hans: 今年至今

source: Daily active hours
zh_hans: 每日活跃时长

source: Each ribbon goes from the app you left to the app you opened next; thicker ribbons mean more frequent switches.
zh_hans: 每条曲线都从你切走的 App 流向你切去的 App；越粗的曲线代表切换越频繁。

source: DND / Focus mode time
zh_hans: 勿扰 / 专注模式时长

source: Apps you used together today
zh_hans: 今天一起使用的 App

source: Live counts read straight from Pulse's local data file. A warning appears if Pulse hasn't written anything in the past minute — usually a sign that a permission was revoked.
zh_hans: 直接从 Pulse 的本地数据文件实时统计。如果过去一分钟 Pulse 没有写入任何东西，这里会出现警告 —— 通常意味着某项权限被撤销了。

source: Diagnostics
zh_hans: 诊断

source: Dismiss
zh_hans: 忽略

source: Distance
zh_hans: 距离

source: Failed to load summary: %@
zh_hans: 加载汇总失败：%@

source: Grant the permissions below in System Settings, then relaunch Pulse. Until then the numbers on this page won't update.
zh_hans: 请在「系统设置」中授予下列权限，然后重启 Pulse。在那之前本页面的数字不会更新。

source: Heatmap window
zh_hans: 热力图窗口

source: How many past days the weekly heatmap covers. Longer windows make each cell smaller; shorter windows emphasise recent pattern.
zh_hans: 热力图覆盖过去多少天。窗口越长，每个格子越小；越短越能突出近期模式。

source: How often the Dashboard window re-queries the local database. Reducing the interval uses a tiny bit more CPU; raising it is fine for passive monitoring.
zh_hans: 仪表盘窗口查询本地数据库的频率。间隔越短越耗 CPU；被动监控场景调大也无妨。

source: Idle time
zh_hans: 空闲时长

source: Input Monitoring
zh_hans: 输入监控

source: Key presses
zh_hans: 按键次数

source: Last data point
zh_hans: 最近数据点

source: Last rollup
zh_hans: 最近汇总

# Last %lld days vs the %lld days before that
source: Last %1$lld days vs the %2$lld days before that
zh_hans: 最近 %1$lld 天与之前的 %2$lld 天相比

source: Last saved
zh_hans: 最近一次保存

source: Last writer error
zh_hans: 最近写入错误

source: Listening to your pulse.
zh_hans: 正在聆听你的脉搏。

source: Loading today's data…
zh_hans: 正在加载今日数据…

source: Location Services
zh_hans: 位置服务

source: Milestone reached
zh_hans: 达成里程碑

source: Lifetime milestone
zh_hans: 终身里程碑

source: Across every day you've used Pulse, your cursor has crossed %@ — %@.
zh_hans: 你使用 Pulse 以来，鼠标累计跨越了 %@ —— %@。

source: Lifetime total: %@.
zh_hans: 终身累计：%@。

source: Mouse clicks
zh_hans: 鼠标点击次数

source: Mouse mileage today
zh_hans: 今日鼠标里程

source: Mouse moves
zh_hans: 鼠标移动次数

source: never
zh_hans: 从未

source: No app activity recorded yet today.
zh_hans: 今天还没有记录到应用活动。

source: No rolled-up activity yet. Check back once hourly roll-ups have run.
zh_hans: 还没有汇总数据。等每小时汇总跑过后再来看。

source: No writes in the last minute — Pulse may have lost a permission. Open Settings → Diagnostics or recheck Input Monitoring + Accessibility under System Settings.
zh_hans: 过去一分钟没有新数据 —— Pulse 可能丢失了权限。打开「设置 → 诊断」，或在系统设置里重新确认「输入监控」和「辅助功能」。

source: Notifications
zh_hans: 通知

source: Open %@
zh_hans: 打开 %@

source: Open Settings
zh_hans: 打开系统设置

source: Counts your keystrokes, clicks and scrolls system-wide. Pulse only counts the events — it never records what you type.
zh_hans: 用来统计你在系统里的按键、点击和滚轮次数。Pulse 只数次数 —— 永远不会记录你输入了什么。

source: Reads which app is in the foreground so Pulse can build your daily ranking. Window titles are hashed before storage.
zh_hans: 用来读取当前前台是哪个 App，从而生成每日应用排行。窗口标题在写入磁盘前会做 SHA-256 哈希。

source: Required for one of Pulse's optional features.
zh_hans: Pulse 某个可选功能需要这项权限。

source: Open %@ settings
zh_hans: 打开 %@ 设置

source: Open Dashboard
zh_hans: 打开仪表盘

source: Patterns Pulse noticed in today's activity, compared to your usual rhythm.
zh_hans: Pulse 在今天的活动里发现的模式，对比你的日常节奏。

source: Paused
zh_hans: 已暂停

source: Paused.
zh_hans: 已暂停。

source: Paused — collection resumes shortly.
zh_hans: 已暂停 — 采集即将恢复。

source: Pause collection…
zh_hans: 暂停采集…

source: Permissions needed
zh_hans: 需要权限

source: Pulse can't collect without the following permissions. Grant them in System Settings, then relaunch Pulse.
zh_hans: Pulse 缺少以下权限就无法采集。请在系统设置中授予后重启 Pulse。

source: Pulse Dashboard
zh_hans: Pulse 仪表盘

source: Pulse isn't collecting right now
zh_hans: Pulse 目前没在采集

source: Quit Pulse
zh_hans: 退出 Pulse

source: Recent heatmap
zh_hans: 近期热力图

source: Refresh
zh_hans: 刷新

source: Refresh every
zh_hans: 刷新频率

source: Resume now
zh_hans: 立即恢复

source: Resumes %@
zh_hans: %@ 恢复

source: Scrolls
zh_hans: 滚动

source: Sensitive period active.
zh_hans: 敏感时段进行中。

source: Stopped.
zh_hans: 已停止。

source: Today
zh_hans: 今天

source: Input
zh_hans: 输入

source: Set a daily target — Pulse will track progress toward it here.
zh_hans: 设置一个每日目标 —— Pulse 会在这里显示你的进度。

source: Settings
zh_hans: 设置

source: Lifetime landmarks
zh_hans: 历史里程碑

source: Top apps
zh_hans: 应用排行

source: Top 5 by count today
zh_hans: 今日按使用次数排前 5 名

source: Top 5 by time today
zh_hans: 今日按使用时长排前 5 名

source: Top shortcuts today
zh_hans: 今日快捷键使用榜

source: Focus breakdown
zh_hans: 专注度分布

source: deep focus
zh_hans: 深度专注

# focus.category.deepFocus
source: Deep focus
zh_hans: 深度专注

# focus.category.communication
source: Communication
zh_hans: 沟通协作

# focus.category.browsing
source: Browsing
zh_hans: 浏览网页

# focus.category.other
source: Other
zh_hans: 其它

source: Keyboard heatmap
zh_hans: 键盘热力图

source: Keycode capture is off by default. Enable it to see which keys you press most — only counts per key leave the event tap, never content or timing.
zh_hans: 键码采集默认关闭。启用后可以看到每个键的使用次数 —— 只记录每个键按了多少次，不记录内容，也不记录时序。

source: Enable keyboard heatmap
zh_hans: 启用键盘热力图

source: Typing data will start accumulating on the next keydown. Come back after a writing session.
zh_hans: 从下一次按键开始累计数据。写一会儿再回来看看。

source: Alerts
zh_hans: 警报

source: Warn me when today's screen time exceeds 8 hours
zh_hans: 今日屏幕时间超过 8 小时时提醒我

source: Fires at most once per day as a local notification.
zh_hans: 每天最多触发一次本地通知。

source: Nudge me after 2 hours with no break
zh_hans: 连续 2 小时没有休息时提醒我

source: A short idle segment resets the counter.
zh_hans: 一次短暂的空闲就会重置计时。

source: Alerts stay local — Pulse never sends anything over the network. macOS may ask for notification permission the first time an alert triggers.
zh_hans: 警报全部留在本地 —— Pulse 永远不会走网络。首次触发时 macOS 可能会请求通知权限。

source: Screen time reminder
zh_hans: 屏幕时间提醒

source: You've been active for %@ today (threshold: %@).
zh_hans: 今天已经活跃 %@（阈值：%@）。

source: Time for a break?
zh_hans: 该休息一下了？

source: You've been active for %@ without a break (threshold: %@).
zh_hans: 连续活跃 %@ 还没休息（阈值：%@）。

source: Total ingest batches
zh_hans: 累计写入批次

source: Two-week heatmap
zh_hans: 两周热力图

source: Updated %@
zh_hans: 更新于 %@

source: Waiting for permissions.
zh_hans: 等待权限中。

source: Weekly heatmap
zh_hans: 周热力图

source: Weekly trend
zh_hans: 每周趋势

source: Yday
zh_hans: 昨天

source: You've moved %@ so far today.
zh_hans: 你今天目前已经走了 %@。

source: Today's mileage just hit %@ — %@.
zh_hans: 今日里程已达 %@ —— %@。

source: %lld-day heatmap
zh_hans: %lld 天热力图

# landmark.step.name
source: step
zh_hans: 一步

# landmark.pool.name
source: swimming pool length
zh_hans: 泳池长度

# landmark.track.name
source: athletics track lap
zh_hans: 田径跑道一圈

# landmark.kilometer.name
source: kilometer
zh_hans: 一千米

# landmark.marathon.name
source: marathon
zh_hans: 马拉松

# landmark.beijing_gz.name
source: Beijing → Guangzhou
zh_hans: 北京到广州

# landmark.pacific.name
source: the Pacific
zh_hans: 太平洋

# landmark.equator.name
source: Earth's equator
zh_hans: 地球赤道

# mileage.comparison.tiny
source: a tiny fraction of %@
zh_hans: 仅为 %@ 的一小段

# mileage.comparison.percent
source: %lld%% of %@
zh_hans: 约为 %2$@ 的 %1$lld%%

# mileage.comparison.aboutOne
source: about 1× %@
zh_hans: 约 1× %@

# permission.status.granted
source: granted
zh_hans: 已授权

# permission.status.denied
source: denied
zh_hans: 已拒绝

# permission.status.notDetermined
source: notDetermined
zh_hans: 未决定

# permission.status.unknown
source: unknown
zh_hans: 未知

source: just now
zh_hans: 刚刚

source: Deep focus today
zh_hans: 今日深度专注

source: Still warming up — your longest focus streak shows up once you've spent 20+ minutes in one app without going idle.
zh_hans: 还没攒够 — 持续待在同一个 app 超过 20 分钟且没变 idle 后，最长专注片段就会出现在这里。

# keystrokes.headline
source: news headline
zh_hans: 一条新闻标题

# keystrokes.sms
source: text message
zh_hans: 一条短信

# keystrokes.tweet
source: tweet
zh_hans: 一条推文

# keystrokes.shortStory
source: short story
zh_hans: 一篇短篇小说

# keystrokes.novella
source: novella
zh_hans: 一部中篇

# keystrokes.novel
source: novel
zh_hans: 一部长篇

# focus.pomodoro
source: pomodoro
zh_hans: 一个番茄钟

# focus.episode
source: episode of a sitcom
zh_hans: 一集情景喜剧

# focus.shortFilm
source: short film
zh_hans: 一部短片

# focus.feature
source: feature film
zh_hans: 一部长片

# focus.workday
source: full work day
zh_hans: 一整个工作日

# scroll.blogPost
source: blog post
zh_hans: 一篇博客

# scroll.tweetFeed
source: tweet-feed session
zh_hans: 一次推文流翻看

# scroll.magazine
source: magazine issue
zh_hans: 一期杂志

# scroll.novel
source: novel
zh_hans: 一本小说

# scroll.encyclopediaVolume
source: encyclopedia volume
zh_hans: 一卷百科全书

source: This week vs last
zh_hans: 本周 vs 上周

source: %lld-day window
zh_hans: %lld 天窗口

source: new
zh_hans: 新

source: Peak typing minute
zh_hans: 今日打字峰值

source: KPM
zh_hans: 次/分钟

source: No typing yet — once you've pressed a key this card will show today's busiest minute.
zh_hans: 今天还没打字 —— 有输入后，这里会显示今天最忙的一分钟。

source: at %@
zh_hans: 出现在 %@

# typing.tier.huntAndPeck
source: hunt-and-peck pace
zh_hans: 逐键寻找节奏

# typing.tier.casual
source: casual typing pace
zh_hans: 日常写作节奏

# typing.tier.touchTypist
source: touch-typist pace
zh_hans: 盲打流畅节奏

# typing.tier.fast
source: fast-typist pace
zh_hans: 快速打字节奏

# typing.tier.sprint
source: keyboard-sprint pace
zh_hans: 键盘冲刺节奏

source: Passive consumption today
zh_hans: 今日被动消费时长

source: Mostly while %@ was in front (%lld%%)
zh_hans: 主要发生在 %@ 前台时（%lld%%）

source: Screen-on time with no input — watched, read, or stepped away while the app kept the foreground.
zh_hans: 屏幕亮着、没有输入的时间 —— 看视频、读长文，或者暂离但应用还在前台。

source: Landmarks
zh_hans: 里程碑

source: Peak at %@
zh_hans: 高峰在 %@

# heatmap.peak.morning
source: morning lark
zh_hans: 早晨型选手

# heatmap.peak.afternoon
source: afternoon worker
zh_hans: 下午型选手

# heatmap.peak.evening
source: evening grinder
zh_hans: 晚间型选手

# heatmap.peak.night
source: night owl
zh_hans: 夜猫子

source: Yesterday in Pulse
zh_hans: Pulse 昨日回顾

source: Yesterday in numbers
zh_hans: 昨天的数字

source: Yesterday's briefing
zh_hans: 昨日简报

source: Got it
zh_hans: 知道了

source: Generate weekly report
zh_hans: 本周报告

# weekly.report.title
source: Pulse · Weekly report
zh_hans: Pulse · 每周报告

# weekly.report.subtitle
source: Activity from %@ through %@
zh_hans: %@ 至 %@ 的活动

# weekly.report.dailyBreakdown
source: Daily breakdown
zh_hans: 每日明细

# weekly.report.day
source: Day
zh_hans: 日期

# weekly.report.app
source: App
zh_hans: 应用

# weekly.report.generated
source: Generated %@ by Pulse
zh_hans: Pulse 于 %@ 生成

source: Anomaly
zh_hans: 异常

source: Today I want to
zh_hans: 今天我想

source: Goals
zh_hans: 目标

source: Achieved
zh_hans: 已达成

source: Toggled goals appear at the top of the Dashboard with a progress bar. Nothing here triggers notifications.
zh_hans: 开启的目标会出现在仪表盘顶部，带进度条。这里的任何选项都不会发送通知。

# goal.active.3h.title
source: Focus for 3 hours
zh_hans: 专注 3 小时

# goal.active.3h.subtitle
source: Total active time today ≥ 3 hours
zh_hans: 今日活跃时长 ≥ 3 小时

# goal.longest.45m.title
source: One 45-minute stretch
zh_hans: 单次专注 ≥ 45 分钟

# goal.longest.45m.subtitle
source: Longest uninterrupted run ≥ 45 minutes
zh_hans: 最长无中断片段 ≥ 45 分钟

# goal.switches.under30.title
source: Fewer than 30 app switches
zh_hans: 应用切换少于 30 次

# goal.switches.under30.subtitle
source: Stay below 30 foreground-app switches today
zh_hans: 今日前台应用切换 ≤ 30 次

# goal.keystrokes.5k.title
source: 5,000 keystrokes
zh_hans: 敲满 5,000 键

# goal.keystrokes.5k.subtitle
source: Total keystrokes today ≥ 5,000
zh_hans: 今日按键 ≥ 5,000 次

source: Export data…
zh_hans: 导出数据

source: Show what Pulse has recorded…
zh_hans: 查看 Pulse 记录了什么…

source: Privacy
zh_hans: 隐私

source: Opens a window that lists the raw row counts and the full system-event log from the past hour — read live from Pulse's local data file.
zh_hans: 打开一个窗口，列出过去一小时的原始行数和完整的系统事件日志 —— 直接从 Pulse 的本地数据文件实时读取。

source: What Pulse has recorded
zh_hans: Pulse 记录了什么

source: Every count and row below is read live from Pulse's local data file — this window shows the raw truth, not a summary kept on the side.
zh_hans: 下面每一个计数和行都是直接从 Pulse 的本地数据文件实时读出的 —— 这个窗口呈现的是原始事实，而不是另外维护的摘要。

source: Mouse move samples
zh_hans: 鼠标移动采样

source: Mouse click samples
zh_hans: 鼠标点击采样

source: Key press samples
zh_hans: 按键采样

source: Key codes stored
zh_hans: 存储的键码数

source: Reload
zh_hans: 重新加载

source: Show database in Finder
zh_hans: 在 Finder 中显示数据库

source: System events (latest first)
zh_hans: 系统事件（最新在前）

source: No system events in the past hour. This table fills in when your Mac sleeps, wakes, locks, opens or closes the lid, or flips a Focus mode.
zh_hans: 过去一小时没有系统事件。当你的 Mac 进入或唤醒睡眠、锁定、合盖或开盖、切换专注模式时，这张表才会有内容。

source: Pulse runs entirely on your Mac. The only outbound traffic is the GitHub Releases check that runs *only* when you click "Check for updates…" — never on a schedule, never in the background.
zh_hans: Pulse 完全运行在你的 Mac 本地。唯一的对外网络流量是「检查更新…」按钮触发的 GitHub Releases 查询 —— 仅在你主动点击时执行，绝不会按计划运行，也绝不会在后台静默触发。

source: Reading the database…
zh_hans: 正在读取数据库…

# privacyAudit.window.template
source: Window: %@ → %@
zh_hans: 时段: %@ → %@

source: Today's rhythm
zh_hans: 今日节奏

source: Not enough app-switch data yet — keep using your Mac and this card will tell you whether today is a checker day or a deep-worker day.
zh_hans: 应用切换数据还不够——继续使用你的 Mac，这张卡片会告诉你今天是「检查员模式」还是「深度工作者模式」。

source: Sessions
zh_hans: 会话数

source: Median
zh_hans: 中位数

source: Average
zh_hans: 平均

source: Longest
zh_hans: 最长

source: Deep-worker mode — most of your sessions today run half an hour or more.
zh_hans: 深度工作者模式——今天大多数会话都在半小时以上。

source: Steady flow — sessions are long enough to settle into real work.
zh_hans: 稳定心流——会话长度足以沉入真正的工作。

source: Step %lld of %lld
zh_hans: 第 %lld 步，共 %lld 步

source: Short-form work — lots of 5-to-15-minute sessions today.
zh_hans: 短节奏工作——今天有不少 5 到 15 分钟的会话。

source: Checker mode — mostly quick dips today, not long-form focus.
zh_hans: 检查员模式——今天基本是短停留，不是长段深度专注。

source: Welcome to Pulse
zh_hans: 欢迎使用 Pulse

source: A local-first dashboard for the way you actually use your Mac. Pulse turns the noisy stream of clicks, key presses, scrolls and app switches into a daily story you can read in 30 seconds.
zh_hans: 本地优先的仪表盘，记录你真正使用 Mac 的方式。Pulse 把点击、按键、滚动、应用切换这些嘈杂的事件流，整理成 30 秒就能读完的每日故事。

source: Privacy promises
zh_hans: 隐私承诺

source: Before we ask for any permissions, here is what Pulse will and will not do — read it first.
zh_hans: 在请求任何权限之前，先把 Pulse 会做和不会做的事讲清楚——请先读完。

source: All raw data stays in Pulse's private folder on your Mac. Nothing is ever uploaded.
zh_hans: 所有原始数据都保留在 Pulse 的本地私有文件夹里，永远不会上传。

source: No keystroke contents — only press counts. By default the key code itself isn't stored either.
zh_hans: 不记录按键内容 —— 只记录按键次数。默认连键码本身也不存。

source: No clipboard content, no screen recording, no microphone, no camera, ever. (Pulse only reads the pasteboard's incrementing change counter to count copy/cut frequency — never the text or files on it.)
zh_hans: 永远不读剪贴板内容、不录屏、不开麦克风、不开摄像头。（Pulse 只读取系统剪贴板每次变动的递增计数，用来统计复制/剪切频率 —— 不读上面的任何文字或文件。）

source: Window titles are hashed before they're written to disk, so Pulse can count app switches without storing what was on the screen.
zh_hans: 窗口标题在写入磁盘前会先经过哈希，让 Pulse 可以统计 App 切换次数，但不会存下你屏幕上显示的内容。

source: Update checks only run when you click “Check for updates…”. Pulse fetches a Sparkle appcast from GitHub Releases at that moment and never on a schedule.
zh_hans: 只有你点击「检查更新…」时 Pulse 才会发起一次出站请求 —— 在那一刻从 GitHub Releases 拉取 Sparkle appcast，绝不在后台按计划自动检查。

source: I've read these promises and want to continue.
zh_hans: 我已经读过这些承诺，希望继续。

source: Grant Input Monitoring
zh_hans: 授权 Input Monitoring

source: Grant Accessibility
zh_hans: 授权 Accessibility

source: Grant permission
zh_hans: 授权

source: Pulse uses Input Monitoring to count clicks, key presses and scroll ticks system-wide. **It only counts events — it never records what you type.** macOS will quit and relaunch Pulse the moment you flip the switch; that's normal.
zh_hans: Pulse 使用 Input Monitoring 在系统层面统计点击、按键、滚动次数。**只数事件本身，绝不记录你打了什么。** 你勾选这个开关时 macOS 会立即退出并重启 Pulse，这是正常现象。

source: Pulse uses Accessibility to read which app is in the foreground and (optionally) the title of the active window. Window titles are hashed before being stored.
zh_hans: Pulse 使用 Accessibility 来识别当前前台应用，以及（可选地）当前活跃窗口的标题。窗口标题会先被哈希再落盘。

source: This permission is required for Pulse to function.
zh_hans: Pulse 需要这个权限才能正常工作。

source: Click **Open System Settings** below.
zh_hans: 点下方的 **打开系统设置**。

source: Find **Pulse** in the list.
zh_hans: 在列表中找到 **Pulse**。

source: Toggle the switch on. macOS may ask for your password.
zh_hans: 把开关打开。macOS 可能会让你输入密码。

source: macOS will close Pulse so the new permission takes effect — that's expected. Just reopen Pulse from your Applications folder; this onboarding will pick up right where it left off.
zh_hans: macOS 会关闭 Pulse 以让新权限生效 —— 这是预期行为，不是崩溃。从「应用程序」文件夹里重新打开 Pulse 即可，引导流程会接着上次的位置继续。

source: Open System Settings
zh_hans: 打开系统设置

source: Granted
zh_hans: 已授权

source: Waiting…
zh_hans: 等待中…

source: You're set
zh_hans: 准备好了

source: Pulse is now collecting your activity locally. Open the menu bar icon any time to pause, peek at today's numbers, or browse what Pulse has recorded. Come back tomorrow morning — the first time you wake your Mac you'll see a one-page briefing of yesterday's run.
zh_hans: Pulse 已经开始在本地采集你的活动了。任何时候点击菜单栏图标都能暂停、查看今日数据，或浏览 Pulse 记录了什么。明早再来 —— 你下一次唤醒 Mac 时，会看到一页关于昨天的简报。

source: Based on US-QWERTY key positions — bars may not reflect physical hands on Dvorak or Colemak.
zh_hans: 基于 US-QWERTY 键位划分 —— 在 Dvorak / Colemak 等其他键盘布局上，左右比例可能与你实际的左右手不符。

source: Back
zh_hans: 上一步

source: Continue
zh_hans: 继续

source: Open Pulse
zh_hans: 进入 Pulse

source: Today's fastest minute, in keystrokes per minute (KPM).
zh_hans: 今天打字最快的那一分钟，单位为按键/分钟（KPM）。

source: Today's pulse — distance, key presses, focus, goals.
zh_hans: 今日脉搏 —— 距离、按键、专注、目标。

source: Patterns over time — weekly trend, heatmap, chronotype, streak.
zh_hans: 随时间变化的模式 —— 周趋势、热力图、作息类型、连续记录。

source: Focus & rest — deepest focus session, posture, peak typing minute.
zh_hans: 专注与休息 —— 最深度的专注片段、会话姿势、键盘最高峰时刻。

source: Apps you used — ranking, switches, combinations, day timeline.
zh_hans: 你使用过的 App —— 排行、切换、组合、当日时间线。

source: Keyboard and mouse — heatmaps, hand balance, clipboard, shortcuts.
zh_hans: 键盘与鼠标 —— 热力图、左右手平衡、剪贴板、快捷键。

source: Today's pulse
zh_hans: 今日脉搏

source: Rhythm
zh_hans: 节奏

source: Focus
zh_hans: 专注

source: Apps
zh_hans: 应用

source: Health
zh_hans: 运行状态

source: Biggest focus stretch this week
zh_hans: 本周最长专注片段

# Focused day in %@
source: Focused day in %1$@
zh_hans: 今日主要在 %1$@

# Your %@ hour was %lld%% busier than usual
source: Your %1$@ hour was %2$lld%% busier than usual
zh_hans: 你 %1$@ 这个小时比平时忙 %2$lld%%

# Your %@ hour was %lld%% quieter than usual
source: Your %1$@ hour was %2$lld%% quieter than usual
zh_hans: 你 %1$@ 这个小时比平时安静 %2$lld%%

# Usually about %lld events at %@. Today: %lld.
source: Usually about %1$lld events at %2$@. Today: %3$lld.
zh_hans: %2$@ 时段平常约 %1$lld 次活动，今天 %3$lld 次。

# Today is %lld%% busier than usual
source: Today is %1$lld%% busier than usual
zh_hans: 今天比往常忙 %1$lld%%

# Today is %lld%% quieter than usual
source: Today is %1$lld%% quieter than usual
zh_hans: 今天比往常安静 %1$lld%%

source: Today's insights
zh_hans: 今日洞察

source: Today's foreground time, grouped automatically by the kind of app you were in.
zh_hans: 今天的前台时间，按你使用的 App 类型自动分组。

# Typical day: about %lld key presses. Today: %lld.
source: Typical day: about %1$lld key presses. Today: %2$lld.
zh_hans: 平常约 %1$lld 次按键，今天 %2$lld 次。

# %@ accounted for %lld%% of your active time (%@).
source: %1$@ accounted for %2$lld%% of your active time (%3$@).
zh_hans: %1$@ 占了活跃时间的 %2$lld%%（%3$@）。

# %@ in %@ — %lld%% longer than your weekly median.
source: %1$@ in %2$@ — %3$lld%% longer than your weekly median.
zh_hans: 在 %2$@ 里 %1$@，比过去一周中位数长 %3$lld%%。

source: Continuity
zh_hans: 连续记录

source: current streak
zh_hans: 当前连续天数

source: Longest: %lld
zh_hans: 最长纪录：%lld 天

# %lld of %lld days qualified
source: %1$lld of %2$lld days qualified
zh_hans: 过去 %2$lld 天里有 %1$lld 天达标
